/*
(i) Код попадает в итоговый файл,
только когда вызвана функция,
например mvsFunctions.spollers();
Или когда импортирован весь файл,
например import "files/script.js";
Неиспользуемый (не вызванный)
код в итоговый файл не попадает.

Если мы хотим добавить модуль
следует его расскоментировать
*/

// Включить/выключить FLS (Full Logging System) (в работе)
window['FLS'] = true;

// Подключение основного файла стилей
import "../scss/style.scss";

// ========================================================================================================================================================================================================================================================
// Функционал ========================================================================================================================================================================================================================================================
// ========================================================================================================================================================================================================================================================
import * as mvsFunctions from "./files/functions.js";

/* Проверка поддержки webp, добавление класса webp или no-webp для HTML */
/* (i) необходимо для корректного отображения webp из css  */
mvsFunctions.isWebp();
/* Добавление класса touch для HTML если браузер мобильный */
// mvsFunctions.addTouchClass();
/* Добавление loaded для HTML после полной загрузки страницы */
// mvsFunctions.addLoadedClass();
/* Модуль для работы с меню (Бургер) */
// mvsFunctions.menuInit();
/* Учет плавающей панели на мобильных устройствах при 100vh */
 mvsFunctions.fullVHfix();

/*
Модуль работы со спойлерами
Сниппет (HTML): spollers
*/
// mvsFunctions.spollers();

/*
Модуль работы с табами
Сниппет (HTML): tabs
*/
// mvsFunctions.tabs();

/*
Модуль "показать еще"
Сниппет (HTML): showmore
*/
// mvsFunctions.showMore();

/*
Попапы
Сниппет (HTML): pl
*/
 import './libs/popup.js'

/*
Модуль параллакса мышью
Сниппет (HTML): 
*/
// import './libs/parallax-mouse.js'

// ========================================================================================================================================================================================================================================================
// Работа с формами ========================================================================================================================================================================================================================================================
// ========================================================================================================================================================================================================================================================
import * as mvsForms from "./files/forms/forms.js";

/* Работа с полями формы */
// mvsForms.formFieldsInit({ viewPass: false });

/* Oтправка формы */
// mvsForms.formSubmit();

/* Модуль формы "колличество" */
// mvsForms.formQuantity();

/* Модуль звездного рейтинга */
// mvsForms.formRating();

/* Модуль работы с select. */
// import './libs/select.js'

/* (В работе) Модуль работы с масками.*/
/*
Подключение и настройка выполняется в файле js/files/forms/inputmask.js
Документация плагина: https://github.com/RobinHerbots/inputmask
Сниппет(HTML):
*/
// import "./files/forms/inputmask.js";

/* Модуль работы с ползунком */
/*
Подключение и настройка выполняется в файле js/files/forms/range.js
Документация плагина: https://refreshless.com/nouislider/
Сниппет (HTML): range
*/
// import "./files/forms/range.js";

/* Модуль работы с подсказками (tippy) */
/*
Подключение плагина Tippy.js и настройка выполняется в файле js/files/tippy.js
Документация плагина: https://atomiks.github.io/tippyjs/
Сниппет (HTML): tip (добавляет атрибут с подсказкой для html тега)
*/
// import "./files/tippy.js";

// ========================================================================================================================================================================================================================================================
// Работа со слайдером (Swiper) ========================================================================================================================================================================================================================================================
// ========================================================================================================================================================================================================================================================
/*
Настройка подключения плагина слайдера Swiper и новых слайдеров выполняется в файле js/files/sliders.js
Документация плагина: https://swiperjs.com/
Сниппет(HTML): swiper
*/
import "./files/sliders.js";

// ========================================================================================================================================================================================================================================================
// Модули работы с прокруткой страницы ========================================================================================================================================================================================================================================================
// ========================================================================================================================================================================================================================================================

/*
Изменение дизайна скроллбара
В HTML добавляем к блоку атрибут data-simplebar
Документация плагина: https://github.com/Grsmto/simplebar/tree/master/packages/simplebar
Сниппет(HTML): 
*/
// import './files/scroll/simplebar.js';

// Ленивая (отложенная) загрузка картинок
// Документация плагина: https://github.com/verlok/vanilla-lazyload
// Сниппет(HTML):
// import './files/scroll/lazyload.js';

// Наблюдатель за объектами c атрибутом data-watch
// Сниппет(HTML):
// import './libs/watcher.js'

// Функции работы скроллом
import * as mvsScroll from "./files/scroll/scroll.js";

// Плавная навигация по странице
// mvsScroll.pageNavigation();

// Функционал добавления классов к хедеру при прокрутке
// mvsScroll.headerScroll();

// Функционал липкого блока
// mvsScroll.stickyBlock();

// ========================================================================================================================================================================================================================================================
// Галерея ========================================================================================================================================================================================================================================================
// ========================================================================================================================================================================================================================================================
/*
Сниппет(HTML):
*/
// import "./files/gallery.js";

// ========================================================================================================================================================================================================================================================
// Прочие плагины ============================================================================================================================================================================================================================================================================================================
// ========================================================================================================================================================================================================================================================

/* Динамический адаптив */
// import "./libs/dynamic_adapt.js";

/* Форматирование чисел */
// import './libs/wNumb.min.js';

// ========================================================================================================================================================================================================================================================
// Прочее ========================================================================================================================================================================================================================================================
// ========================================================================================================================================================================================================================================================
/* Подключаем файлы со своим кодом */
import "./files/script.js";
//============================================================================================================================================================================================================================================